#pragma once

// RealmRoyale (0.23) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "RL_TgClient_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class TgClient.TgBrowserManager
// 0x0158 (0x01B8 - 0x0060)
class UTgBrowserManager : public UObject
{
public:
	struct FString                                     URLGold;                                                  // 0x0060(0x0010) (NeedCtorLink)
	struct FString                                     URLAlert;                                                 // 0x0070(0x0010) (NeedCtorLink)
	struct FString                                     URLStore;                                                 // 0x0080(0x0010) (NeedCtorLink)
	struct FString                                     URLBooster;                                               // 0x0090(0x0010) (NeedCtorLink)
	struct FString                                     URLSupport;                                               // 0x00A0(0x0010) (NeedCtorLink)
	struct FString                                     URLProfile;                                               // 0x00B0(0x0010) (NeedCtorLink)
	struct FString                                     URLRedirect;                                              // 0x00C0(0x0010) (NeedCtorLink)
	struct FString                                     URLActivateKey;                                           // 0x00D0(0x0010) (NeedCtorLink)
	struct FString                                     URLCreateAccount;                                         // 0x00E0(0x0010) (NeedCtorLink)
	struct FString                                     URLRecoverPassword;                                       // 0x00F0(0x0010) (NeedCtorLink)
	struct FString                                     URLRecoverUsername;                                       // 0x0100(0x0010) (NeedCtorLink)
	struct FString                                     URLGodPack;                                               // 0x0110(0x0010) (NeedCtorLink)
	struct FString                                     URLRanked;                                                // 0x0120(0x0010) (NeedCtorLink)
	struct FString                                     URLFacebookPromo;                                         // 0x0130(0x0010) (NeedCtorLink)
	struct FString                                     URLTwitterPromo;                                          // 0x0140(0x0010) (NeedCtorLink)
	struct FString                                     URLRecruitPromo;                                          // 0x0150(0x0010) (NeedCtorLink)
	struct FString                                     URLPlayerStats;                                           // 0x0160(0x0010) (NeedCtorLink)
	struct FString                                     URLTwitchSignup;                                          // 0x0170(0x0010) (NeedCtorLink)
	struct FString                                     URLTwitchHelp;                                            // 0x0180(0x0010) (NeedCtorLink)
	struct FString                                     URLLaunchTournament;                                      // 0x0190(0x0010) (NeedCtorLink)
	struct FString                                     URLLinkAccount;                                           // 0x01A0(0x0010) (NeedCtorLink)
	class UUIWebBrowser*                               m_pContainer;                                             // 0x01B0(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgBrowserManager");
		return ptr;
	}


	void AccountLink();
	void LaunchTournament();
	void TwitchSignup();
	void TwitchHelp();
	void PlayerStats(const struct FString& sPlayerName);
	void RecruitPromo();
	void TwitterPromo();
	void FacebookPromo();
	void RankedRules();
	void GodPack();
	void SubmitBugReport(const struct FString& sPlayerName);
	void RecoverUsername();
	void RecoverPassword();
	void CreateAccount();
	void ActivateKey();
	void Profile();
	void Support();
	void Booster();
	void Store();
	void Gold();
	void Alert();
	void STATIC_SetContainer(class UUIWebBrowser* pContainer);
	void STATIC_ResizeView();
	void STATIC_Close();
	void STATIC_OpenVideo(const struct FString& URL, bool bAddName);
	void STATIC_OpenURL(const struct FString& URL, bool bShowNavButtons);
	void STATIC_ExternalOpenURL(const struct FString& URL, bool bAddLang);
	bool STATIC_IsBrowserLoaded();
};


// Class TgClient.TgChatData
// 0x0064 (0x00C4 - 0x0060)
class UTgChatData : public UObject
{
public:
	int                                                m_nId;                                                    // 0x0060(0x0004)
	int                                                m_nSoundId;                                               // 0x0064(0x0004)
	int                                                m_nChannel;                                               // 0x0068(0x0004)
	unsigned long                                      m_bFeedback : 1;                                          // 0x006C(0x0004)
	unsigned long                                      m_bSenderIsVIP : 1;                                       // 0x006C(0x0004)
	unsigned long                                      m_bIsVGS : 1;                                             // 0x006C(0x0004)
	struct FString                                     m_sSender;                                                // 0x0070(0x0010) (NeedCtorLink)
	struct Fdword                                      m_dwSenderVIPTier;                                        // 0x0080(0x0004)
	struct FString                                     m_sMessage;                                               // 0x0084(0x0010) (NeedCtorLink)
	struct FString                                     m_sSenderColor;                                           // 0x0094(0x0010) (NeedCtorLink)
	struct FString                                     m_sSenderClass;                                           // 0x00A4(0x0010) (NeedCtorLink)
	struct FString                                     m_sMessageColor;                                          // 0x00B4(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgChatData");
		return ptr;
	}

};


// Class TgClient.TgClientHUD
// 0x008C (0x062C - 0x05A0)
class ATgClientHUD : public ATgHUD
{
public:
	int                                                m_nMapId;                                                 // 0x05A0(0x0004)
	unsigned char                                      m_eState;                                                 // 0x05A4(0x0001)
	unsigned char                                      m_ePromptType;                                            // 0x05A5(0x0001)
	unsigned char                                      m_eCaptureState;                                          // 0x05A6(0x0001)
	unsigned char                                      UnknownData00[0x1];                                       // 0x05A7(0x0001) MISSED OFFSET
	unsigned long                                      m_bCommitMap : 1;                                         // 0x05A8(0x0004)
	unsigned long                                      m_bShowCursor : 1;                                        // 0x05A8(0x0004)
	unsigned long                                      m_bCaptureKeys : 1;                                       // 0x05A8(0x0004)
	float                                              m_fFadeTime;                                              // 0x05AC(0x0004)
	float                                              m_fFadeTimer;                                             // 0x05B0(0x0004)
	float                                              m_fReturnTime;                                            // 0x05B4(0x0004)
	float                                              m_fReturnTimer;                                           // 0x05B8(0x0004)
	float                                              m_fControllerTime;                                        // 0x05BC(0x0004)
	float                                              m_fControllerTimer;                                       // 0x05C0(0x0004)
	class UUIGameMoviePlayer*                          m_pMovie;                                                 // 0x05C4(0x0008)
	TArray<struct FString>                             m_sNeededScenes;                                          // 0x05CC(0x0010) (NeedCtorLink)
	TArray<struct FSceneInfo>                          m_ScenePreloads;                                          // 0x05DC(0x0010) (NeedCtorLink)
	TArray<class UTgGfxScene*>                         m_SceneStack;                                             // 0x05EC(0x0010) (NeedCtorLink)
	TArray<class UTgGfxScene*>                         m_PopupStack;                                             // 0x05FC(0x0010) (NeedCtorLink)
	TArray<class UUIMoviePlayer*>                      m_MoviePlayers;                                           // 0x060C(0x0010) (AlwaysInit, NeedCtorLink)
	class UUIGAPeachStartup*                           m_GAPeach;                                                // 0x061C(0x0008) (AlwaysInit)
	class UTgDevMenuMoviePlayer*                       m_DevMenu;                                                // 0x0624(0x0008) (AlwaysInit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgClientHUD");
		return ptr;
	}


	void Tick(float DeltaTime);
	void PostBeginPlay();
	void STATIC_TogglePushToTalk(bool bEnable);
	void STATIC_ToggleDevMenu();
	void STATIC_ToggleHUD();
	void STATIC_TestDidIt(int nActivityId, int nCount);
	void STATIC_ResetViewCenterPoint();
	bool STATIC_RemoveSceneFromStack(class UTgGfxScene* pScene, bool bPopAll);
	bool STATIC_PushScene(const struct FString& sName, bool bSkipPrivilegeCheck);
	bool STATIC_PopScene(int nIndex);
	void STATIC_ClearScenes(unsigned char ePreviousState, unsigned char eTargetState);
	void STATIC_ShowSubtitle(int nMessage, float fTime);
	void ShowHit(class AActor* Target, float fDamageAmount, bool bIsShieldHit, struct FExtraDamageInfo* ExtraInfo);
	void ShowCursor(bool bShow);
	void Initialize();
	bool STATIC_IsLoggedIn();
	bool STATIC_IsInGame();
};


// Class TgClient.TgData_Cards
// 0x0008 (0x0068 - 0x0060)
class UTgData_Cards : public UTgObject
{
public:
	class UUIGameMoviePlayer*                          m_pMovie;                                                 // 0x0060(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgData_Cards");
		return ptr;
	}


	void Initialize(class UUIGameMoviePlayer* pMoviePlayer);
};


// Class TgClient.TgDataChunk
// 0x0054 (0x016C - 0x0118)
class UTgDataChunk : public UGFxObject
{
public:
	class UTgDataHandler*                              m_DataHandler;                                            // 0x0118(0x0008)
	class UTgDataChunk*                                m_ParentChunk;                                            // 0x0120(0x0008)
	TArray<struct FDataField>                          m_DataList;                                               // 0x0128(0x0010) (AlwaysInit, NeedCtorLink)
	TArray<class UTgDataChunk*>                        m_ChildChunks;                                            // 0x0138(0x0010) (AlwaysInit, NeedCtorLink)
	unsigned long                                      m_bIsDirty : 1;                                           // 0x0148(0x0004)
	unsigned long                                      m_bIsSubscribed : 1;                                      // 0x0148(0x0004)
	unsigned long                                      m_bClearOnMapChange : 1;                                  // 0x0148(0x0004)
	struct FScriptDelegate                             __usc_Subscribe_Delegate__Delegate;                       // 0x014C(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                                       // 0x014C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __usc_Unsubscribe_Delegate__Delegate;                     // 0x015C(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x4];                                       // 0x015C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgDataChunk");
		return ptr;
	}


	void STATIC_usc_Unsubscribe();
	void STATIC_usc_Subscribe();
	void usc_Unsubscribe_Delegate();
	void usc_Subscribe_Delegate();
	class ATgPlayerController* STATIC_GetPlayerController();
	void STATIC_NotifyMapChange();
	bool STATIC_IsSubscribed();
	void SetDirty();
	bool STATIC_GetField(const struct FString& FieldName, struct FASValue* NewValue);
	bool STATIC_SetField(const struct FString& FieldName, bool bCreateIfMissing, struct FASValue* NewValue);
	void STATIC_AddField(const struct FString& FieldName, struct FASValue* NewValue);
	void STATIC_ClearDelegates();
	void STATIC_SetDelegates();
	void STATIC_RemoveChild(class UTgDataChunk* Child, bool bClearDelegates);
	void STATIC_AddChild(class UTgDataChunk* Child);
	void STATIC_DataUpdateEvent();
	void STATIC_Update(float DeltaTime, bool bSkipCallback);
	void STATIC_InitializeData(class UTgDataHandler* Handler, class UTgDataChunk* parentChunk);
};


// Class TgClient.TgDataHandler
// 0x0018 (0x0130 - 0x0118)
class UTgDataHandler : public UGFxObject
{
public:
	class UUIMoviePlayer*                              m_MP;                                                     // 0x0118(0x0008)
	TArray<class UTgDataChunk*>                        m_DataChunkList;                                          // 0x0120(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgDataHandler");
		return ptr;
	}


	void STATIC_NotifyMapChange();
	void STATIC_Update(float DeltaTime);
	void STATIC_InitializeDataHandler(class UUIMoviePlayer* mp);
};


// Class TgClient.TgDataManager
// 0x0038 (0x0098 - 0x0060)
class UTgDataManager : public UObject
{
public:
	class UTgData_EOM*                                 m_EOMData;                                                // 0x0060(0x0008)
	class UTgData_Cards*                               m_CardData;                                               // 0x0068(0x0008)
	class UTgData_Notifications*                       m_NotificationData;                                       // 0x0070(0x0008)
	TArray<class UTgDataObject*>                       m_DataSets;                                               // 0x0078(0x0010) (AlwaysInit, NeedCtorLink)
	TArray<class UTgDataObject*>                       m_Callbacks;                                              // 0x0088(0x0010) (AlwaysInit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgDataManager");
		return ptr;
	}

};


// Class TgClient.TgGameLaunch
// 0x0024 (0x04F0 - 0x04CC)
class ATgGameLaunch : public AGameInfo
{
public:
	struct FString                                     LoginName;                                                // 0x04CC(0x0010) (Config, GlobalConfig, NeedCtorLink)
	struct FString                                     LoginPwd;                                                 // 0x04DC(0x0010) (Config, GlobalConfig, NeedCtorLink)
	unsigned long                                      SaveLoginName : 1;                                        // 0x04EC(0x0004) (Config, GlobalConfig)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameLaunch");
		return ptr;
	}

};


// Class TgClient.TgGameViewportClient
// 0x0024 (0x01E8 - 0x01C4)
class UTgGameViewportClient : public UPComGameViewportClient
{
public:
	TArray<class UTgObjectReferencer*>                 m_DeferredManifests;                                      // 0x01C4(0x0010) (NeedCtorLink)
	unsigned long                                      m_dragging : 1;                                           // 0x01D4(0x0004)
	unsigned long                                      m_wasMaximized : 1;                                       // 0x01D4(0x0004)
	unsigned long                                      bReadLeftStickAxis : 1;                                   // 0x01D4(0x0004) (Transient)
	unsigned long                                      bReadRightStickAxis : 1;                                  // 0x01D4(0x0004) (Transient)
	float                                              fRawLeftStickAxis;                                        // 0x01D8(0x0004) (Transient)
	float                                              fRawRightStickAxis;                                       // 0x01DC(0x0004) (Transient)
	float                                              fRawRightStickX;                                          // 0x01E0(0x0004) (Transient)
	float                                              fRawRightStickY;                                          // 0x01E4(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgGameViewportClient");
		return ptr;
	}


	bool Init(struct FString* OutError);
	void STATIC_LayoutPlayers();
	void STATIC_GetSubtitleRegion(struct FVector2D* MinPos, struct FVector2D* MaxPos);
	void STATIC_GameSessionEnded();
	void STATIC_InitTgGameViewportClient();
	bool STATIC_IsGfxMovieCapturingMouseInput();
	void STATIC_NativeGameSessionEnded();
	void DrawTransition(class UCanvas* Canvas);
};


// Class TgClient.TgSeasonTicketManager
// 0x00A8 (0x012C - 0x0084)
class UTgSeasonTicketManager : public UPComUIManagerBase
{
public:
	class UUIGameMoviePlayer*                          m_pMovie;                                                 // 0x0084(0x0008)
	TArray<class UUIData_EsportsDisplayGroup*>         m_DisplayGroups;                                          // 0x008C(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x48];                                      // 0x009C(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.TgSeasonTicketManager.m_MatchupDescriptions
	unsigned char                                      UnknownData01[0x48];                                      // 0x00E4(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.TgSeasonTicketManager.m_TeamImages

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgSeasonTicketManager");
		return ptr;
	}

};


// Class TgClient.TgSynchronizedTimer
// 0x0014 (0x012C - 0x0118)
class UTgSynchronizedTimer : public UGFxObject
{
public:
	unsigned long                                      m_bPausedByGame : 1;                                      // 0x0118(0x0004)
	unsigned long                                      m_bSuppressCallback : 1;                                  // 0x0118(0x0004)
	unsigned long                                      m_bRunning : 1;                                           // 0x0118(0x0004)
	unsigned long                                      m_bPaused : 1;                                            // 0x0118(0x0004)
	class UUIMoviePlayer*                              m_MP;                                                     // 0x011C(0x0008)
	class UTgTimerManager*                             m_TimerManager;                                           // 0x0124(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgSynchronizedTimer");
		return ptr;
	}


	bool STATIC_IsPaused();
	bool STATIC_IsRunning();
	void STATIC_EventCallback(int nTimerId, TEnumAsByte<ETGT_EVENT> eEvent);
	void STATIC_ExpireTimer(bool bFromCallback);
	void STATIC_UpdateTimer(float fElapsed, float fTotal, bool bPaused, bool bFromCallback);
	void STATIC_StartTimer(float fSeconds);
};


// Class TgClient.UIDataShop
// 0x0214 (0x0274 - 0x0060)
class UUIDataShop : public UObject
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x0060(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.UIDataShop.m_LootTableItems
	unsigned char                                      UnknownData01[0x48];                                      // 0x00A8(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.UIDataShop.m_Vendors
	unsigned char                                      UnknownData02[0x48];                                      // 0x00F0(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.UIDataShop.m_RealMoneyItems
	unsigned char                                      UnknownData03[0x48];                                      // 0x0138(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.UIDataShop.m_Items
	unsigned char                                      UnknownData04[0x48];                                      // 0x0180(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.UIDataShop.m_SKUtoLootId
	TArray<struct FMarketplaceProductDetails>          m_MarketplaceProducts;                                    // 0x01C8(0x0010) (NeedCtorLink)
	struct FMultiMap_Mirror                            m_RequiredItemReverseLookup;                              // 0x01D8(0x0048) (Native)
	TArray<struct Fdword>                              m_dwContinuousRequestVendors;                             // 0x0220(0x0010) (NeedCtorLink)
	float                                              m_fContinuousRequestTimer;                                // 0x0230(0x0004)
	TArray<struct Fdword>                              m_dwInfoVendors;                                          // 0x0234(0x0010) (NeedCtorLink)
	TArray<struct Fdword>                              m_dwStoreVendors;                                         // 0x0244(0x0010) (NeedCtorLink)
	TArray<struct Fdword>                              m_dwRealMoneyVendors;                                     // 0x0254(0x0010) (NeedCtorLink)
	unsigned long                                      m_bAllStoreVendorsLoaded : 1;                             // 0x0264(0x0004)
	unsigned long                                      m_bFinishedStoringRealMoneyItemData : 1;                  // 0x0264(0x0004)
	struct Fdword                                      m_dwVendorRequestId;                                      // 0x0268(0x0004)
	struct Fdword                                      m_dwContinuousVendorsRequestId;                           // 0x026C(0x0004)
	struct Fdword                                      m_dwRealMoneyVendorsRequestId;                            // 0x0270(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIDataShop");
		return ptr;
	}


	void GetMarketplaceProductsByType(class UUIGameMoviePlayer* pMoviePlayer, TEnumAsByte<EMediaItemType> MediaType, TArray<struct FMarketplaceProductDetails>* AvailableProducts);
	void STATIC_StoreRealMoneyItemData();
};


// Class TgClient.UILandingPanelManager
// 0x0060 (0x00E4 - 0x0084)
class UUILandingPanelManager : public UPComUIManagerBase
{
public:
	struct FPointer                                    VfTable_ITgCallbackInterface;                             // 0x0084(0x0008) (Const, Native, NoExport)
	class UUIGameMoviePlayer*                          m_pMovie;                                                 // 0x008C(0x0008)
	unsigned char                                      UnknownData00[0x48];                                      // 0x0094(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.UILandingPanelManager.m_JsonDiscountData
	class UTgCallbackContainer*                        m_CallbackContainer;                                      // 0x00DC(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UILandingPanelManager");
		return ptr;
	}

};


// Class TgClient.UIMoviePlayer
// 0x00A8 (0x02A0 - 0x01F8)
class UUIMoviePlayer : public UGFxMoviePlayer
{
public:
	int                                                m_nLastTimerIndex;                                        // 0x01F8(0x0004)
	unsigned long                                      m_bInitialized : 1;                                       // 0x01FC(0x0004)
	unsigned long                                      m_bInTransition : 1;                                      // 0x01FC(0x0004)
	unsigned long                                      m_bResizeForSafeZones : 1;                                // 0x01FC(0x0004)
	class UGFxObject*                                  m_mcRoot;                                                 // 0x0200(0x0008)
	class UGFxObject*                                  m_mcGlobal;                                               // 0x0208(0x0008)
	class UTgDataHandler*                              m_DataHandler;                                            // 0x0210(0x0008)
	class UTgTimerManager*                             m_TimerManager;                                           // 0x0218(0x0008)
	class UClass*                                      m_DataHandlerClass;                                       // 0x0220(0x0008)
	struct FPointer                                    m_pTgCallbackDevice;                                      // 0x0228(0x0008) (Native)
	struct FPointer                                    m_pKeybindLookup;                                         // 0x0230(0x0008) (Native)
	class UOnlineSubsystem*                            OnlineSub;                                                // 0x0238(0x0008)
	TScriptInterface<class UOnlineGameInterface>       GameInterface;                                            // 0x0240(0x0010)
	TScriptInterface<class UOnlineVoiceInterface>      VoiceInterface;                                           // 0x0250(0x0010)
	TScriptInterface<class UOnlinePlayerInterface>     PlayerInterface;                                          // 0x0260(0x0010)
	TScriptInterface<class UOnlineContentInterface>    ContentInterface;                                         // 0x0270(0x0010)
	TScriptInterface<class UOnlinePlayerInterfaceEx>   PlayerInterfaceEx;                                        // 0x0280(0x0010)
	TScriptInterface<class UOnlineMarketplaceInterface> MarketplaceInterface;                                     // 0x0290(0x0010)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIMoviePlayer");
		return ptr;
	}


	void ShowEmptyStoreDialog();
	void SetMarketplaceVisibility(bool Visible, unsigned char IconPosition);
	void STATIC_usc_ClipboardCopy(const struct FString& Str);
	struct FString STATIC_usc_ClipboardPaste();
	void STATIC_InitOSSRef();
	void Init(class ULocalPlayer* LocPlay);
	void Tick(float DeltaTime);
	bool STATIC_usc_IME_Exists();
	bool STATIC_usc_IME_SetEnabled(bool bEnabled);
	struct FString STATIC_usc_TranslateMsg(const struct FString& Identifier, const struct FString& SectionName);
	struct FString STATIC_usc_TranslateMsgId(int nId);
	void STATIC_ShowTransitionScene(bool bShow);
	void STATIC_usc_toggle_arrow_key_navigation(bool bAllowNav);
	void STATIC_usc_toggle_key_capture(bool bCapture);
	void STATIC_usc_toggle_cursor(bool bShow);
	void STATIC_usc_Console_Command(const struct FString& Cmd);
	void STATIC_usc_Data_Handler_Created();
	void STATIC_QuitGame();
	void UnregisterEngineCallbacks();
	void RegisterEngineCallbacks();
	struct FString STATIC_GetTranslatedKeyBind(const struct FString& Command, int nAlternate, bool bLocalizeKB, bool bLocalizeMouse, bool bLocalizeGamepad);
	void STATIC_UpdateViewportForSafeAreas();
	void STATIC_NativeTick(float DeltaTime);
	void STATIC_InitializeDataHandler();
	void STATIC_PostInit();
	void STATIC_OnClose();
	class ATgPlayerController* GetPlayerOwner();
	class ATgClientHUD* STATIC_GetHUD();
};


// Class TgClient.TgDevMenuMoviePlayer
// 0x0008 (0x02A8 - 0x02A0)
class UTgDevMenuMoviePlayer : public UUIMoviePlayer
{
public:
	class UGFxObject*                                  m_DevMenu;                                                // 0x02A0(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgDevMenuMoviePlayer");
		return ptr;
	}


	bool STATIC_FilterButtonInput(int ControllerId, const struct FName& ButtonName, TEnumAsByte<EInputEvent> Event);
	void STATIC_OnClose();
	void STATIC_PostInit();
	void STATIC_usc_FillCommands(const struct FString& MenuName);
	void STATIC_AddSubMenu(const struct FString& Section, const struct FString& submenuname, const struct FString& DisplayName);
	void STATIC_AddCommand(const struct FString& Section, const struct FString& Command, const struct FString& DisplayName);
	void STATIC_FillSubMenuCommands(const struct FString& submenuname);
	void STATIC_FillMenuCommands();
};


// Class TgClient.UIGAPeachStartup
// 0x0010 (0x02B0 - 0x02A0)
class UUIGAPeachStartup : public UUIMoviePlayer
{
public:
	float                                              m_fHirezAnimTimer;                                        // 0x02A0(0x0004)
	float                                              m_fPeachAnimTimer;                                        // 0x02A4(0x0004)
	float                                              m_fSkipDelay;                                             // 0x02A8(0x0004)
	float                                              m_fSkipDelayTimer;                                        // 0x02AC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIGAPeachStartup");
		return ptr;
	}


	void STATIC_OnClose();
	void STATIC_PostInit();
	void Init(class ULocalPlayer* LocPlay);
	void STATIC_UpdateViewportForSafeAreas();
};


// Class TgClient.UIObject
// 0x0000 (0x0118 - 0x0118)
class UUIObject : public UGFxObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIObject");
		return ptr;
	}

};


// Class TgClient.UIPatchNotesJsonManager
// 0x0080 (0x0104 - 0x0084)
class UUIPatchNotesJsonManager : public UPComUIManagerBase
{
public:
	class UUIGameMoviePlayer*                          m_pMovie;                                                 // 0x0084(0x0008)
	struct FPatchNotesData                             m_PatchData;                                              // 0x008C(0x0068)
	TArray<class UTexture2DDynamic*>                   m_PatchImages;                                            // 0x00F4(0x0010) (Native)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIPatchNotesJsonManager");
		return ptr;
	}

};


// Class TgClient.UIData
// 0x0000 (0x0060 - 0x0060)
class UUIData : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData");
		return ptr;
	}

};


// Class TgClient.TgDataObject
// 0x005C (0x00BC - 0x0060)
class UTgDataObject : public UUIData
{
public:
	unsigned long                                      m_bDirty : 1;                                             // 0x0060(0x0004)
	unsigned long                                      m_bCallback : 1;                                          // 0x0060(0x0004)
	TArray<TEnumAsByte<EUIID>>                         m_Laundry;                                                // 0x0064(0x0010) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x48];                                      // 0x0074(0x0048) UNKNOWN PROPERTY: MapProperty TgClient.TgDataObject.m_Data

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgDataObject");
		return ptr;
	}

};


// Class TgClient.TgData_EOM
// 0x00CC (0x0188 - 0x00BC)
class UTgData_EOM : public UTgDataObject
{
public:
	int                                                m_nKills;                                                 // 0x00BC(0x0004)
	int                                                m_nPlace;                                                 // 0x00C0(0x0004)
	int                                                m_nGameId;                                                // 0x00C4(0x0004)
	int                                                m_nProfile;                                               // 0x00C8(0x0004)
	int                                                m_nQueueId;                                               // 0x00CC(0x0004)
	int                                                m_nGameTime;                                              // 0x00D0(0x0004)
	int                                                m_nLocalTF;                                               // 0x00D4(0x0004)
	int                                                m_nWinningTF;                                             // 0x00D8(0x0004)
	int                                                m_nClassXPTotal;                                          // 0x00DC(0x0004)
	int                                                m_nClassXPTimeAlive;                                      // 0x00E0(0x0004)
	int                                                m_nClassXPPlacement;                                      // 0x00E4(0x0004)
	int                                                m_nClassXPElims;                                          // 0x00E8(0x0004)
	float                                              m_fClassXPMultiplier;                                     // 0x00EC(0x0004)
	int                                                m_nBattlepassXPTotal;                                     // 0x00F0(0x0004)
	int                                                m_nBattlepassXPTimeAlive;                                 // 0x00F4(0x0004)
	int                                                m_nBattlepassXPPlacement;                                 // 0x00F8(0x0004)
	int                                                m_nBattlepassXPElims;                                     // 0x00FC(0x0004)
	float                                              m_fBattlepassXPMultiplier;                                // 0x0100(0x0004)
	int                                                m_nQuestsCompletedThisSession;                            // 0x0104(0x0004)
	int                                                m_nXPBonus;                                               // 0x0108(0x0004)
	int                                                m_nXPEarned;                                              // 0x010C(0x0004)
	int                                                m_nCharacterXPEarned;                                     // 0x0110(0x0004)
	int                                                m_nCharacterXPBonus;                                      // 0x0114(0x0004)
	int                                                m_nTokens;                                                // 0x0118(0x0004)
	int                                                m_nTokensFound;                                           // 0x011C(0x0004)
	int                                                m_nTokensKills;                                           // 0x0120(0x0004)
	int                                                m_nTokensBonus;                                           // 0x0124(0x0004)
	int                                                m_nTokensQuests;                                          // 0x0128(0x0004)
	int                                                m_nTokensVictory;                                         // 0x012C(0x0004)
	TArray<class UUIData_PlayerMatchRecord*>           m_Players;                                                // 0x0130(0x0010) (NeedCtorLink)
	TArray<class UUIData_Quest*>                       m_AlreadyCompletedQuests;                                 // 0x0140(0x0010) (NeedCtorLink)
	TArray<struct FCurrencyEntry>                      m_vCurrencyEntries;                                       // 0x0150(0x0010) (NeedCtorLink)
	struct FCurrencyEntry                              m_NullCurrency;                                           // 0x0160(0x0028) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgData_EOM");
		return ptr;
	}

};


// Class TgClient.TgData_Notifications
// 0x0010 (0x00CC - 0x00BC)
class UTgData_Notifications : public UTgDataObject
{
public:
	TArray<struct FNotification>                       m_Notifications;                                          // 0x00BC(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.TgData_Notifications");
		return ptr;
	}

};


// Class TgClient.UIData_Actor
// 0x0008 (0x0068 - 0x0060)
class UUIData_Actor : public UUIData
{
public:
	class AActor*                                      m_pActor;                                                 // 0x0060(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Actor");
		return ptr;
	}

};


// Class TgClient.UIData_BattlePassLevel
// 0x0010 (0x0070 - 0x0060)
class UUIData_BattlePassLevel : public UUIData
{
public:
	int                                                m_nLevel;                                                 // 0x0060(0x0004)
	class UUIData_LootTableItem*                       m_pLTI;                                                   // 0x0064(0x0008)
	unsigned long                                      m_bUnlocked : 1;                                          // 0x006C(0x0004)
	unsigned long                                      m_bPremium : 1;                                           // 0x006C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_BattlePassLevel");
		return ptr;
	}

};


// Class TgClient.UIData_BattlePassTier
// 0x001C (0x007C - 0x0060)
class UUIData_BattlePassTier : public UUIData
{
public:
	int                                                m_nTier;                                                  // 0x0060(0x0004)
	struct Fdword                                      m_dwPlayerBPXP;                                           // 0x0064(0x0004)
	TArray<class UUIData*>                             m_pLevelRewards;                                          // 0x0068(0x0010) (NeedCtorLink)
	unsigned long                                      m_bHasBonusRewards : 1;                                   // 0x0078(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_BattlePassTier");
		return ptr;
	}

};


// Class TgClient.UIData_Challenge
// 0x004C (0x00AC - 0x0060)
class UUIData_Challenge : public UUIData
{
public:
	struct Fdword                                      m_dwActivityId;                                           // 0x0060(0x0004)
	struct Fdword                                      m_eStatus;                                                // 0x0064(0x0004)
	unsigned long                                      m_bIsDirty : 1;                                           // 0x0068(0x0004)
	unsigned long                                      m_bCompletionAck : 1;                                     // 0x0068(0x0004)
	unsigned long                                      m_bGoalsInitialized : 1;                                  // 0x0068(0x0004)
	TArray<class UUIData_Goal*>                        m_pPrimaryGoals;                                          // 0x006C(0x0010) (NeedCtorLink)
	TArray<class UUIData_Goal*>                        m_pGatingGoals;                                           // 0x007C(0x0010) (NeedCtorLink)
	TArray<class UUIData_Goal*>                        m_pAllDoneGoals;                                          // 0x008C(0x0010) (NeedCtorLink)
	TArray<class UUIData_Goal*>                        m_pAuxiliaryGoals;                                        // 0x009C(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Challenge");
		return ptr;
	}

};


// Class TgClient.UIData_ChampionChests
// 0x0010 (0x0070 - 0x0060)
class UUIData_ChampionChests : public UUIData
{
public:
	TArray<class UUIData_ChestExtended*>               m_Chests;                                                 // 0x0060(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_ChampionChests");
		return ptr;
	}

};


// Class TgClient.UIData_ChestExtended
// 0x003C (0x009C - 0x0060)
class UUIData_ChestExtended : public UUIData
{
public:
	int                                                nItemId;                                                  // 0x0060(0x0004)
	int                                                nBotRefId;                                                // 0x0064(0x0004)
	int                                                nVendorId;                                                // 0x0068(0x0004)
	int                                                nSortOrder;                                               // 0x006C(0x0004)
	int                                                nRarity;                                                  // 0x0070(0x0004)
	int                                                nBundleVendorId;                                          // 0x0074(0x0004)
	int                                                nBundleCount;                                             // 0x0078(0x0004)
	int                                                nBundleLootIds[0x4];                                      // 0x007C(0x0004)
	int                                                nBundleItemCounts[0x4];                                   // 0x008C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_ChestExtended");
		return ptr;
	}

};


// Class TgClient.UIData_CustomGame
// 0x0040 (0x00A0 - 0x0060)
class UUIData_CustomGame : public UUIData
{
public:
	struct Fdword                                      m_dwOriginalQueueId;                                      // 0x0060(0x0004)
	struct Fdword                                      m_dwMatchId;                                              // 0x0064(0x0004)
	struct FString                                     m_sQueueName;                                             // 0x0068(0x0010) (AlwaysInit, NeedCtorLink)
	struct Fdword                                      m_dwOwnerPlayerId;                                        // 0x0078(0x0004)
	struct FString                                     m_sOwnerName;                                             // 0x007C(0x0010) (AlwaysInit, NeedCtorLink)
	unsigned long                                      m_bHasPassword : 1;                                       // 0x008C(0x0004)
	struct Fdword                                      m_dwSiteId;                                               // 0x0090(0x0004)
	int                                                m_nMinPlayers;                                            // 0x0094(0x0004)
	int                                                m_nMaxPlayers;                                            // 0x0098(0x0004)
	int                                                m_nNumPlayers;                                            // 0x009C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_CustomGame");
		return ptr;
	}

};


// Class TgClient.UIData_CustomGameManager
// 0x0024 (0x0084 - 0x0060)
class UUIData_CustomGameManager : public UUIData
{
public:
	struct FString                                     sName;                                                    // 0x0060(0x0010) (AlwaysInit, NeedCtorLink)
	struct FString                                     sDesc;                                                    // 0x0070(0x0010) (AlwaysInit, NeedCtorLink)
	int                                                nIcon;                                                    // 0x0080(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_CustomGameManager");
		return ptr;
	}

};


// Class TgClient.UIData_CustomPlayer
// 0x0008 (0x0068 - 0x0060)
class UUIData_CustomPlayer : public UUIData
{
public:
	int                                                m_nTaskForce;                                             // 0x0060(0x0004)
	struct Fdword                                      m_dwPlayerId;                                             // 0x0064(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_CustomPlayer");
		return ptr;
	}

};


// Class TgClient.UIData_CustomQueue
// 0x002C (0x008C - 0x0060)
class UUIData_CustomQueue : public UUIData
{
public:
	struct Fdword                                      m_dwQueueId;                                              // 0x0060(0x0004)
	struct FString                                     m_sDesc;                                                  // 0x0064(0x0010) (AlwaysInit, NeedCtorLink)
	struct FString                                     m_sShortDesc;                                             // 0x0074(0x0010) (AlwaysInit, NeedCtorLink)
	int                                                m_nTaskforceSize;                                         // 0x0084(0x0004)
	int                                                m_nSortOrder;                                             // 0x0088(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_CustomQueue");
		return ptr;
	}

};


// Class TgClient.UIData_DailyRewardDay
// 0x000C (0x006C - 0x0060)
class UUIData_DailyRewardDay : public UUIData
{
public:
	int                                                m_nDayIndex;                                              // 0x0060(0x0004)
	int                                                m_nCurrentDay;                                            // 0x0064(0x0004)
	unsigned long                                      m_bClaimed : 1;                                           // 0x0068(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_DailyRewardDay");
		return ptr;
	}

};


// Class TgClient.UIData_Deck
// 0x0060 (0x00C0 - 0x0060)
class UUIData_Deck : public UUIData
{
public:
	class UUIDataItem*                                 m_pDeckItems[0x5];                                        // 0x0060(0x0008)
	int                                                m_nId;                                                    // 0x0088(0x0004)
	unsigned long                                      m_bIsTemplate : 1;                                        // 0x008C(0x0004)
	struct FString                                     m_sName;                                                  // 0x0090(0x0010) (NeedCtorLink)
	struct FString                                     m_sDisplayName;                                           // 0x00A0(0x0010) (NeedCtorLink)
	struct FString                                     m_sDescription;                                           // 0x00B0(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Deck");
		return ptr;
	}

};


// Class TgClient.UIData_Default
// 0x0000 (0x0060 - 0x0060)
class UUIData_Default : public UUIData
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Default");
		return ptr;
	}

};


// Class TgClient.UIData_EsportsDisplayGroup
// 0x0020 (0x0080 - 0x0060)
class UUIData_EsportsDisplayGroup : public UUIData
{
public:
	struct FString                                     m_sName;                                                  // 0x0060(0x0010) (AlwaysInit, NeedCtorLink)
	TArray<int>                                        m_nGroupIds;                                              // 0x0070(0x0010) (AlwaysInit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_EsportsDisplayGroup");
		return ptr;
	}

};


// Class TgClient.UIData_Float
// 0x0004 (0x0064 - 0x0060)
class UUIData_Float : public UUIData
{
public:
	float                                              m_fValue;                                                 // 0x0060(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Float");
		return ptr;
	}

};


// Class TgClient.UIData_Goal
// 0x000C (0x006C - 0x0060)
class UUIData_Goal : public UUIData
{
public:
	struct Fdword                                      m_dwActivityId;                                           // 0x0060(0x0004)
	struct Fdword                                      m_dwGoalGroupId;                                          // 0x0064(0x0004)
	struct Fdword                                      m_dwGoalId;                                               // 0x0068(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Goal");
		return ptr;
	}

};


// Class TgClient.UIData_HeaderTab
// 0x0014 (0x0074 - 0x0060)
class UUIData_HeaderTab : public UUIData
{
public:
	struct FString                                     m_sTitle;                                                 // 0x0060(0x0010) (NeedCtorLink)
	int                                                m_nCTACount;                                              // 0x0070(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_HeaderTab");
		return ptr;
	}

};


// Class TgClient.UIData_Index
// 0x0004 (0x0064 - 0x0060)
class UUIData_Index : public UUIData
{
public:
	struct Fdword                                      m_dwValue;                                                // 0x0060(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_Index");
		return ptr;
	}

};


// Class TgClient.UIData_LeaderboardPlayer
// 0x0040 (0x00A0 - 0x0060)
class UUIData_LeaderboardPlayer : public UUIData
{
public:
	struct FString                                     sName;                                                    // 0x0060(0x0010) (AlwaysInit, NeedCtorLink)
	struct FQWord                                      qwPortalUserId;                                           // 0x0070(0x0008)
	float                                              fRank;                                                    // 0x0078(0x0004)
	int                                                nLevel;                                                   // 0x007C(0x0004)
	int                                                nWins;                                                    // 0x0080(0x0004)
	int                                                nLosses;                                                  // 0x0084(0x0004)
	int                                                nPerk;                                                    // 0x0088(0x0004)
	int                                                nRegion;                                                  // 0x008C(0x0004)
	int                                                nTitle;                                                   // 0x0090(0x0004)
	int                                                nPosition;                                                // 0x0094(0x0004)
	class UUIDataChampion*                             pChampion;                                                // 0x0098(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LeaderboardPlayer");
		return ptr;
	}

};


// Class TgClient.UIData_LeagueEOM
// 0x002C (0x008C - 0x0060)
class UUIData_LeagueEOM : public UUIData
{
public:
	class UUIDataLeague*                               m_pLeague;                                                // 0x0060(0x0008)
	class UUIDataLeagueTier*                           m_pTier;                                                  // 0x0068(0x0008)
	int                                                m_nPointChange;                                           // 0x0070(0x0004)
	int                                                m_nCurrentPoints;                                         // 0x0074(0x0004)
	int                                                m_nWins;                                                  // 0x0078(0x0004)
	int                                                m_nLosses;                                                // 0x007C(0x0004)
	int                                                m_nMatchesPlayed;                                         // 0x0080(0x0004)
	class UUIData_LeagueTierChange*                    m_TierChange;                                             // 0x0084(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LeagueEOM");
		return ptr;
	}

};


// Class TgClient.UIData_LeagueTierChange
// 0x0019 (0x0079 - 0x0060)
class UUIData_LeagueTierChange : public UUIData
{
public:
	class UUIDataLeague*                               m_League;                                                 // 0x0060(0x0008)
	class UUIDataLeagueTier*                           m_PrevTier;                                               // 0x0068(0x0008)
	class UUIDataLeagueTier*                           m_NextTier;                                               // 0x0070(0x0008)
	TEnumAsByte<EUIDLTC_PromotionType>                 m_ePromotionType;                                         // 0x0078(0x0001)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LeagueTierChange");
		return ptr;
	}

};


// Class TgClient.UIData_List
// 0x0010 (0x0070 - 0x0060)
class UUIData_List : public UUIData
{
public:
	TArray<class UUIData*>                             pData;                                                    // 0x0060(0x0010) (AlwaysInit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_List");
		return ptr;
	}

};


// Class TgClient.UIData_List_TitleIcon
// 0x0014 (0x0084 - 0x0070)
class UUIData_List_TitleIcon : public UUIData_List
{
public:
	int                                                nIcon;                                                    // 0x0070(0x0004)
	TArray<struct FString>                             sTitles;                                                  // 0x0074(0x0010) (AlwaysInit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_List_TitleIcon");
		return ptr;
	}

};


// Class TgClient.UIData_LobbySlotItem
// 0x0010 (0x0070 - 0x0060)
class UUIData_LobbySlotItem : public UUIData
{
public:
	TEnumAsByte<EUIChampionCustomizeState>             eState;                                                   // 0x0060(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0061(0x0003) MISSED OFFSET
	struct FPointer                                    pItemInfo;                                                // 0x0064(0x0008) (Native)
	unsigned long                                      bActive : 1;                                              // 0x006C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LobbySlotItem");
		return ptr;
	}

};


// Class TgClient.UIData_LootTableItem
// 0x0024 (0x0084 - 0x0060)
class UUIData_LootTableItem : public UUIData
{
public:
	struct Fdword                                      m_dwLootId;                                               // 0x0060(0x0004)
	class UUIData_Vendor*                              m_pParentVendor;                                          // 0x0064(0x0008)
	TArray<class UUIDataPrice*>                        m_Prices;                                                 // 0x006C(0x0010) (NeedCtorLink)
	struct Fdword                                      m_dwPrevRequiredItemId;                                   // 0x007C(0x0004)
	unsigned long                                      m_bIsDynamicStoreBundle : 1;                              // 0x0080(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LootTableItem");
		return ptr;
	}

};


// Class TgClient.UIData_LTIAggregate
// 0x0010 (0x0070 - 0x0060)
class UUIData_LTIAggregate : public UUIData
{
public:
	TArray<class UUIData_LootTableItem*>               m_Items;                                                  // 0x0060(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_LTIAggregate");
		return ptr;
	}

};


// Class TgClient.UIData_MapMarker
// 0x0014 (0x0074 - 0x0060)
class UUIData_MapMarker : public UUIData
{
public:
	unsigned long                                      m_bActive : 1;                                            // 0x0060(0x0004)
	float                                              m_fTimer;                                                 // 0x0064(0x0004)
	struct FVector                                     m_vLocation;                                              // 0x0068(0x000C)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_MapMarker");
		return ptr;
	}

};


// Class TgClient.UIData_MasteryReward
// 0x001C (0x007C - 0x0060)
class UUIData_MasteryReward : public UUIData
{
public:
	struct Fdword                                      m_dwLevel;                                                // 0x0060(0x0004)
	class UUIData_LootTableItem*                       m_pLTIGiven;                                              // 0x0064(0x0008)
	class UUIDataItem*                                 m_pItem;                                                  // 0x006C(0x0008)
	class UUIDataChampion*                             m_pChampion;                                              // 0x0074(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_MasteryReward");
		return ptr;
	}

};


// Class TgClient.UIData_MatchBoosterActivated
// 0x0018 (0x0078 - 0x0060)
class UUIData_MatchBoosterActivated : public UUIData
{
public:
	struct Fdword                                      dwSourcePlayerId;                                         // 0x0060(0x0004)
	struct Fdword                                      dwTaskForce;                                              // 0x0064(0x0004)
	struct Fdword                                      eItemBoosterSubtype;                                      // 0x0068(0x0004)
	float                                              fMultiplier;                                              // 0x006C(0x0004)
	class UUIDataItem*                                 pBoosterItem;                                             // 0x0070(0x0008)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_MatchBoosterActivated");
		return ptr;
	}

};


// Class TgClient.UIData_MatchInvitePlayerState
// 0x0001 (0x0061 - 0x0060)
class UUIData_MatchInvitePlayerState : public UUIData
{
public:
	TEnumAsByte<EMatchInvitePlayerState>               m_eState;                                                 // 0x0060(0x0001)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class TgClient.UIData_MatchInvitePlayerState");
		return ptr;
	}

};


// Class TgClient.UIData_MatchMember
// 0x0030 (0x0090 - 0x0060)
class UUIData_MatchMember : public UUIData
{
public:
	struct FString                                     sName;                                                    // 0x0060(0x0010) (AlwaysInit, NeedCtorLink)
	struct Fdword                                      dwPlayerId;                                               // 0x0070(0x0004)
	struct FQWord                                      qwUserId;                                                 // 0x0074(0x0008)
	unsigned long                                      bIsVIP : 1;                                               // 0x007C(0x0004)
